packages/go/results.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ../../script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 43s max duration (incl. graceful stop):
              * delayed_start: 10 looping VUs for 10s (startTime: 3s, gracefulStop: 30s)


running (01.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  2.0s

running (02.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  1.0s

running (03.0s), 00/10 VUs, 0 complete and 0 interrupted iterations
delayed_start • [   0% ] waiting  0.0s

running (04.0s), 10/10 VUs, 61325 complete and 0 interrupted iterations
delayed_start   [  10% ] 10 VUs  01.0s/10s

running (05.0s), 10/10 VUs, 119244 complete and 0 interrupted iterations
delayed_start   [  20% ] 10 VUs  02.0s/10s

running (06.0s), 10/10 VUs, 186654 complete and 0 interrupted iterations
delayed_start   [  30% ] 10 VUs  03.0s/10s

running (07.0s), 10/10 VUs, 253152 complete and 0 interrupted iterations
delayed_start   [  40% ] 10 VUs  04.0s/10s

running (08.0s), 10/10 VUs, 319811 complete and 0 interrupted iterations
delayed_start   [  50% ] 10 VUs  05.0s/10s

running (09.0s), 10/10 VUs, 385408 complete and 0 interrupted iterations
delayed_start   [  60% ] 10 VUs  06.0s/10s

running (10.0s), 10/10 VUs, 453255 complete and 0 interrupted iterations
delayed_start   [  70% ] 10 VUs  07.0s/10s

running (11.0s), 10/10 VUs, 520170 complete and 0 interrupted iterations
delayed_start   [  80% ] 10 VUs  08.0s/10s

running (12.0s), 10/10 VUs, 588125 complete and 0 interrupted iterations
delayed_start   [  90% ] 10 VUs  09.0s/10s

running (13.0s), 10/10 VUs, 658200 complete and 0 interrupted iterations
delayed_start   [ 100% ] 10 VUs  10.0s/10s

     data_received..................: 422 MB 33 MB/s
     data_sent......................: 53 MB  4.1 MB/s
     http_req_blocked...............: avg=1µs      min=0s      med=0s      max=11.09ms p(90)=1µs      p(95)=1µs     
     http_req_connecting............: avg=8ns      min=0s      med=0s      max=1.08ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=124.16µs min=24µs    med=83µs    max=78.58ms p(90)=199µs    p(95)=268µs   
       { expected_response:true }...: avg=124.16µs min=24µs    med=83µs    max=78.58ms p(90)=199µs    p(95)=268µs   
     http_req_failed................: 0.00%  ✓ 0            ✗ 658302
     http_req_receiving.............: avg=14.72µs  min=3µs     med=4µs     max=78.28ms p(90)=10µs     p(95)=16µs    
     http_req_sending...............: avg=4.2µs    min=1µs     med=1µs     max=41.42ms p(90)=3µs      p(95)=7µs     
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=105.23µs min=19µs    med=74µs    max=48.28ms p(90)=183µs    p(95)=245µs   
     http_reqs......................: 658302 50635.857678/s
     iteration_duration.............: avg=146.5µs  min=30.91µs med=96.04µs max=78.61ms p(90)=222.62µs p(95)=303.04µs
     iterations.....................: 658302 50635.857678/s
     vus............................: 10     min=0          max=10  
     vus_max........................: 10     min=10         max=10  


running (13.0s), 00/10 VUs, 658302 complete and 0 interrupted iterations
delayed_start ✓ [ 100% ] 10 VUs  10s